import Header from "@/components/layout/Header/Header";
import StaticPage, {
  PageTitle,
  Paragraph,
  SectionHeader,
} from "@/components/layout/StaticPage/StaticPage";

export default function AboutPage() {
  return (
    <>
      <Header variant="internal" title="درباره ما" backUrl="/" />

      <StaticPage>
        <PageTitle>درباره کادوچی</PageTitle>

        <Paragraph>
          از سال ۱۳۹۱، کادوچی به عنوان یک برند تخصصی در حوزه هدیه، گل و محصولات
          مناسبتی فعالیت خود را با هدف ایجاد تجربه‌ای آسان، سریع و لذت‌بخش در
          انتخاب و ارسال هدیه آغاز کرد. ما با تکیه بر خلاقیت، کیفیت و ارائه
          خدمات حرفه‌ای، بستری فراهم کرده‌ایم که کاربران بتوانند متناسب با
          مناسبت، شخصیت و سلیقه فرد مورد نظر، هدیه‌ای هوشمندانه و ارزشمند انتخاب
          کنند. کادوچی تنها یک فروشگاه نیست؛ بلکه یک همراه تجربه‌ساز است که
          انتخاب هدیه را از یک کار دشوار و زمان‌بر، به فرآیندی دلپذیر، ساده و
          الهام‌بخش تبدیل می‌کند.
        </Paragraph>
        <Paragraph>
          در کادوچی، ما به باور قدرتمند «هدیه تنها یک بسته نیست، بلکه حامل احساس
          است» پایبندیم. به همین دلیل، علاوه بر ارائه طیف گسترده‌ای از محصولات
          منتخب، امکان بسته‌بندی اختصاصی، ارسال مستقیم برای عزیزان، حتی از راه
          دور و خلق لحظه‌ای خاص در زمان دریافت هدیه را فراهم کرده‌ایم. تمام تلاش
          ما این است که با هر سفارش، زمینه‌ساز لبخند و احساس خوشایندی باشیم که
          در یادها بماند. شعار ما «برای دیدن لبخند تو» صرفاً یک جمله نیست؛
          فلسفه‌ای است که مسیر کاری و تعهد ما را تعریف می‌کند.
        </Paragraph>
      </StaticPage>
    </>
  );
}
